tap "homebrew/bundle"
tap "oven-sh/bun"
brew "autoconf"
brew "automake"
brew "gcc"
brew "btop"
brew "coreutils"
brew "gh"
brew "git"
brew "libusbmuxd"
brew "libimobiledevice"
brew "ideviceinstaller"
brew "lazygit"
brew "libksba"
brew "libtool"
brew "libusb"
brew "make"
brew "neovim"
brew "nvm"
brew "oh-my-posh"
brew "openssl@1.1"
brew "pipx"
brew "pkg-config"
brew "pyenv"
brew "python@3.10"
brew "ranger"
brew "ruby"
brew "xclip"
brew "zlib"
brew "oven-sh/bun/bun"
cask "google-chrome"
cask "visual-studio-code"
