tap "deskflow/tap"
brew "bat"
brew "btop"
brew "cocoapods"
brew "eza"
brew "fzf"
brew "neovim"
brew "nvm"
brew "oh-my-posh"
brew "opencode"
brew "openjdk@17", link: true
brew "ranger"
cask "android-studio"
cask "bettershot"
cask "brave-browser"
cask "deskflow/tap/deskflow"
cask "docker-desktop"
cask "mullvad-vpn"
cask "nextcloud-vfs"
cask "obs"
cask "rustdesk"
cask "submariner"
cask "visual-studio-code"
cask "zerotier-one"
vscode "aaron-bond.better-comments"
vscode "antfu.iconify"
vscode "antiantisepticeye.vscode-color-picker"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "bbenoist.qml"
vscode "be5invis.toml"
vscode "bodil.prettier-toml"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "cloudedcat.vscode-model-viewer"
vscode "codezombiech.gitignore"
vscode "csharpier.csharpier-vscode"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "devsense.composer-php-vscode"
vscode "devsense.intelli-php-vscode"
vscode "devsense.phptools-vscode"
vscode "devsense.profiler-php-vscode"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.codespaces"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "irongeek.vscode-env"
vscode "jannisx11.batch-rename-extension"
vscode "jock.svg"
vscode "johnpapa.pwa-tools"
vscode "johnpapa.vscode-peacock"
vscode "lyzerk.linecounter"
vscode "mariusalchimavicius.json-to-ts"
vscode "mechatroner.rainbow-csv"
vscode "moalamri.inline-fold"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-playwright.playwright"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "mtxr.sqltools"
vscode "naumovs.color-highlight"
vscode "nguyenhoanglam.beautiful-dracula"
vscode "nuxt.mdc"
vscode "oven.bun-vscode"
vscode "pkief.material-icon-theme"
vscode "platformio.platformio-ide"
vscode "pomdtr.excalidraw-editor"
vscode "raczzalan.webgl-glsl-editor"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "s-nlf-fh.glassit"
vscode "selemondev.shadcn-vue"
vscode "shakram02.bash-beautify"
vscode "shrey150.javafx-support"
vscode "stxr.iconfont-preview"
vscode "suhelmakkad.shadcn-ui"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "uctakeoff.vscode-counter"
vscode "vira.vsc-vira-theme"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-initializr"
vscode "vue.volar"
vscode "wix.vscode-import-cost"
vscode "wmaurer.change-case"
vscode "yinfei.luahelper"
vscode "yoavbls.pretty-ts-errors"
vscode "zh9528.file-size"
